#!/usr/bin/env python
#coding:utf-8

'''
Created on 2020-01-25

@author :yanglei
'''


#编码集（密码本）
#ascii：不支持中文
#gbk: 
#     英文8位1字节
#     中文16位2字节
#unicode（万国码）：
#                  英文16位 2字节
#                  中文32位 4字节
#utf-8:
#      英文8位 1字节
#      欧洲16位 2字节
#      亚洲24位 3字节

#单位转换
#1字节 = 8位
#1Bytes = 8bit
#1024Bytes = 1KB
#1024KB = 1MB
#1024MB = 1GB
#1024GB = 1TB
#1024TB = 1PB
#1024PB = 1EB



#进制转换
#10转2
#186 0 
#93  1   
#46  0
#23  1  
#11  1
#5   1
#2   0
#1   1
  


#70 0
#35 1
#17 1
#8  0
#4  0
#2  0

#56 0
#28 0
#14 0
#7  1
#3  1
#1  1
print(bin(90))
#0b111000
#0b=二进制
#计算的顺序和读取的顺序是反的


#二进制转十进制 - 从右往左进行计算
#111000
#0 * 2 **0 + 0 * 2**1 + 0 * 2 **2 + 1 * 2**3 + 1 * 2**4 + 1 * 2 **5
#    0     +     0    +      0    +    8     +    16    +     32
# = 56

#10101
# 1 * 2**0 + 0 * 2**1 + 1 * 2**2 + 0 * 2**3 + 1 * 2**4
#     1    +     0    +     4    +     0    +     16
# 21

#程序十进制转二进制
bin(100)
#二进制转十进制
int('1100100',2) 

#False
bool(0)
bool('')

#True
bool(-1) 
bool(1)
bool('')
#字符串不为空True，为空False
#0为True，非零包含负数True